# add할 단어들을 list형태로 반환
def get_addwords():
    english_words = ['IT', 'HP', 'AR', 'B2C', 'QLED', 'GPU', 'LLM', 'POSTECH', 'EU', 'FDA', 'IP', 'KISA', 'VR', 'MS', 'RPG',
                     'MMORPG', 'LTE', 'NFT', 'AI', 'OTT', 'TV', 'QR', 'iOS', '6G', 'SW', 'SaaS', 'PC', 'OS', 'MR', 'UAE', 'WHO',
                     '5G', 'API', 'OLED', 'SM', 'MOU', 'FTA', 'XR', 'HBM', 'B2B', 'UWB', 'CPU', 'AWS', 'NASA', '3D', 'MZ', '버추얼'

    ]

    company_words = ['SK', 'LG', 'KT', 'NASA', '테슬라', '엔비디아', 'NVIDIA', '삼성전자', 'LG전자', 'SK하이닉스', '네오위즈', '스마일게이트',
                    '넷마블', 'LG이노텍', 'SKT', '리브모바일', '헬로모바일'
    ]

    korean_words = ['누누티비', '챗GPT', '블록체인', '웨어러블', '자율주행', '인공지능', '단통법', '데브시스터즈', '메타버스',
                    '랜섬웨어', '부사', '사장', '과학기술정보통신부', '신사업', '열전소자', '카카오게임즈', '언어모델', '블록챗', 'T맵', 'MZ세대',
                    '원격제어', '폴더블', '원스토어', '가상자산', '쿠팡플레이', '빅테크', '스타링크', '카카오페이', '당근마켓', '컴투스홀딩스',
                    '업스테이지', '야놀자', '야나두', '다크버스', '생활가전사업부', '파파고', '팝업스토어', '한글과컴퓨터', '배틀그라운드',
                    '다누리', '클라우드', '과기정통부'
    ]
    
    result = english_words + company_words + korean_words
    return result

# 불용어를 list형태로 반환
def get_stopwords():
    stop_words = ['기자', '사진', '통해', '때문', '위해', '이번', '지난', '있는', '같은', '경우', '대표', '기술', '현재', '있는', '기업',
                  '서비스', '시장', '전화', '이메일', '구독', '업체', '제공', '출처', '참고자료', '제품', '앵커', '팀장', '교수', '제보',
                  '인턴', '전화', '자료사진', '추진', '실증', '지원', '분야', '참여', '오사', '도록', '로부터',
                  '대한', '까지', '관련', '잘못'
    ]
    
    names = ['이대호', '송이라', '홍관희'
    ]

    result = stop_words + names
    return result